Wang/nn_chemistry/2D_Ar_H2_O2/ffcm2/coarse_mesh_slip_NS_methane/constant/thermFFCM2

/*--------------------------------*- C++ -*----------------------------------*  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  6
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermo.compressibleGas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * /

    H2
    {
        specie
        {
            molWeight    2.016;
        }
        thermodynamics
        {
            Tlow    200.0;
            Thigh    6000.0;
            Tcommon    1000.0;
            highCpCoeffs    (2.93286575 0.000826608026 -1.46402364e-07 1.54100414e-11 -6.888048e-16 -813.065581 -1.02432865);
            lowCpCoeffs    (2.34433112 0.00798052075 -1.9478151e-05 2.01572094e-08 -7.37611761e-12 -917.935173 0.683010238);
        }
        transport
        {
            As    1.67e-06; //possibly unused
            Ts    170.0; //possibly unused
        }
    }
    
    H
    {
        specie
        {
            molWeight    1.008;
        }
        thermodynamics
        {
            Tlow    200.0;
            Thigh    6000.0;
            Tcommon    1000.0;
            highCpCoeffs    (2.5 0.0 0.0 0.0 0.0 25473.66 -0.44668285);
            lowCpCoeffs    (2.5 0.0 0.0 0.0 0.0 25473.66 -0.44668285);
        }
        transport
        {
            As    1.67e-06; //possibly unused
            Ts    170.0; //possibly unused
        }
    }
    
    O2
    {
        specie
        {
            molWeight    31.998;
        }
        thermodynamics
        {
            Tlow    200.0;
            Thigh    6000.0;
            Tcommon    1000.0;
            highCpCoeffs    (3.66096065 0.000656365811 -1.41149627e-07 2.05797935e-11 -1.29913436e-15 -1215.97718 3.41536279);
            lowCpCoeffs    (3.78245636 -0.00299673416 9.84730201e-06 -9.68129509e-09 3.24372837e-12 -1063.94356 3.65767573);
        }
        transport
        {
            As    1.67e-06; //possibly unused
            Ts    170.0; //possibly unused
        }
    }
    
    O
    {
        specie
        {
            molWeight    15.999;
        }
        thermodynamics
        {
            Tlow    200.0;
            Thigh    6000.0;
            Tcommon    1000.0;
            highCpCoeffs    (2.54363697 -2.73162486e-05 -4.1902952e-09 4.95481845e-12 -4.79553694e-16 29226.012 4.92229457);
            lowCpCoeffs    (3.1682671 -0.00327931884 6.64306396e-06 -6.12806624e-09 2.11265971e-12 29122.2592 2.05193346);
        }
        transport
        {
            As    1.67e-06; //possibly unused
            Ts    170.0; //possibly unused
        }
    }
    
    OH
    {
        specie
        {
            molWeight    17.007;
        }
        thermodynamics
        {
            Tlow    200.0;
            Thigh    6000.0;
            Tcommon    1000.0;
            highCpCoeffs    (2.83853033 0.00110741289 -2.94000209e-07 4.20698729e-11 -2.4228989e-15 3697.80808 5.84494652);
            lowCpCoeffs    (3.99198424 -0.00240106655 4.61664033e-06 -3.87916306e-09 1.36319502e-12 3368.89836 -0.103998477);
        }
        transport
        {
            As    1.67e-06; //possibly unused
            Ts    170.0; //possibly unused
        }
    }
    
    HO2
    {
        specie
        {
            molWeight    33.006;
        }
        thermodynamics
        {
            Tlow    200.0;
            Thigh    5000.0;
            Tcommon    1000.0;
            highCpCoeffs    (4.17228741 0.00188117627 -3.46277286e-07 1.94657549e-11 1.76256905e-16 31.0206839 2.95767672);
            lowCpCoeffs    (4.30179807 -0.00474912097 2.11582905e-05 -2.42763914e-08 9.29225225e-12 264.018485 3.7166622);
        }
        transport
        {
            As    1.67e-06; //possibly unused
            Ts    170.0; //possibly unused
        }
    }
    
    H2O
    {
        specie
        {
            molWeight    18.015;
        }
        thermodynamics
        {
            Tlow    200.0;
            Thigh    6000.0;
            Tcommon    1000.0;
            highCpCoeffs    (2.6770389 0.0029731816 -7.7376889e-07 9.4433514e-11 -4.2689991e-15 -29885.894 6.88255);
            lowCpCoeffs    (4.1986352 -0.0020364017 6.5203416e-06 -5.4879269e-09 1.771968e-12 -30293.726 -0.84900901);
        }
        transport
        {
            As    1.67e-06; //possibly unused
            Ts    170.0; //possibly unused
        }
    }
    
    CH3
    {
        specie
        {
            molWeight    15.035;
        }
        thermodynamics
        {
            Tlow    200.0;
            Thigh    6000.0;
            Tcommon    1000.0;
            highCpCoeffs    (2.9781206 0.005797852 -1.97558e-06 3.072979e-10 -1.7917416e-14 16509.513 4.7224799);
            lowCpCoeffs    (3.6571797 0.0021265979 5.4583883e-06 -6.6181003e-09 2.4657074e-12 16422.716 1.6735354);
        }
        transport
        {
            As    1.67e-06; //possibly unused
            Ts    170.0; //possibly unused
        }
    }
    
    CH4
    {
        specie
        {
            molWeight    16.043;
        }
        thermodynamics
        {
            Tlow    200.0;
            Thigh    6000.0;
            Tcommon    1000.0;
            highCpCoeffs    (1.65326226 0.0100263099 -3.31661238e-06 5.36483138e-10 -3.14696758e-14 -10009.5936 9.90506283);
            lowCpCoeffs    (5.14911468 -0.0136622009 4.91453921e-05 -4.84246767e-08 1.66603441e-11 -10246.5983 -4.63848842);
        }
        transport
        {
            As    1.67e-06; //possibly unused
            Ts    170.0; //possibly unused
        }
    }
    
    CO
    {
        specie
        {
            molWeight    28.009999999999998;
        }
        thermodynamics
        {
            Tlow    200.0;
            Thigh    6000.0;
            Tcommon    1000.0;
            highCpCoeffs    (3.0484859 0.0013517281 -4.8579405e-07 7.8853644e-11 -4.6980746e-15 -14266.117 6.0170977);
            lowCpCoeffs    (3.5795335 -0.00061035369 1.0168143e-06 9.0700586e-10 -9.0442449e-13 -14344.086 3.5084093);
        }
        transport
        {
            As    1.67e-06; //possibly unused
            Ts    170.0; //possibly unused
        }
    }
    
    CO2
    {
        specie
        {
            molWeight    44.009;
        }
        thermodynamics
        {
            Tlow    200.0;
            Thigh    6000.0;
            Tcommon    1000.0;
            highCpCoeffs    (4.6365111 0.0027414569 -9.9589759e-07 1.6038666e-10 -9.1619857e-15 -49024.904 -1.9348955);
            lowCpCoeffs    (2.356813 0.0089841299 -7.1220632e-06 2.4573008e-09 -1.4288548e-13 -48371.971 9.9009035);
        }
        transport
        {
            As    1.67e-06; //possibly unused
            Ts    170.0; //possibly unused
        }
    }
    
    CH2O
    {
        specie
        {
            molWeight    30.026;
        }
        thermodynamics
        {
            Tlow    200.0;
            Thigh    6000.0;
            Tcommon    1000.0;
            highCpCoeffs    (3.16952665 0.0061932056 -2.25056366e-06 3.6597566e-10 -2.20149458e-14 -14548.6831 6.04207898);
            lowCpCoeffs    (4.79372312 -0.00990833322 3.7321999e-05 -3.79285237e-08 1.31772641e-11 -14379.1953 0.602798058);
        }
        transport
        {
            As    1.67e-06; //possibly unused
            Ts    170.0; //possibly unused
        }
    }
    
    N2
    {
        specie
        {
            molWeight    28.014;
        }
        thermodynamics
        {
            Tlow    200.0;
            Thigh    6000.0;
            Tcommon    1000.0;
            highCpCoeffs    (2.95257637 0.0013969004 -4.92631603e-07 7.86010195e-11 -4.60755204e-15 -923.948688 5.87188762);
            lowCpCoeffs    (3.53100528 -0.000123660988 -5.02999433e-07 2.43530612e-09 -1.40881235e-12 -1046.97628 2.96747038);
        }
        transport
        {
            As    1.67e-06; //possibly unused
            Ts    170.0; //possibly unused
        }
    }
    