Wang/nn_chemistry/2D_Ar_H2_O2/ffcm2/coarse_mesh_slip_NS_methane/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type             hePsiThermo;
    mixture         reactingMixture;
    transport       sutherland;
    thermo          janaf;
    energy          sensibleInternalEnergy;
    equationOfState perfectGas;
    specie          specie;
}

inertSpecie AR;

chemistryReader foamChemistryReader;

foamChemistryFile "$FOAM_CASE/constant/chemFFCM2";

foamChemistryThermoFile "$FOAM_CASE/constant/thermFFCM2";

// ************************************************************************* //
