Wang/nn_chemistry/2D_Ar_H2_O2/ffcm2/coarse_mesh_slip_NS_methane/constant/trandat
H                   0    1.008    2.050    145.000    0.000    0.000    0.000
H2                  1    2.016    2.920     38.000    0.000    0.790  280.000
O                   0   15.999    2.750     80.000    0.000    0.000    0.000
OH                  1   17.007    2.750     80.000    0.000    0.000    0.000
H2O                 2   18.015    2.605    572.400    1.844    0.000    4.000
O2                  1   31.998    3.458    107.400    0.000    1.600    3.800
HO2                 2   33.006    3.458    107.400    0.000    0.000    1.000
H2O2                2   34.014    3.458    107.400    0.000    0.000    3.800
N2                  1   28.014    3.621     97.530    0.000    1.760    4.000
CH3                 1   15.035    3.800    144.000    0.000    0.000    1.000
CH4                 1   16.043    3.758    141.400    0.000    2.600   13.000
CO                  1   28.010    3.650    98.1000    0.000    1.950    1.800
CO2                 2   44.009    3.763    244.000    0.000    2.650    2.100
CH2O                2   30.026    3.590    498.000    2.330    0.000    2.000